---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NotEnoughRisers
source: html/120b849c-416b-c98a-f835-5a9af3340147.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NotEnoughRisers Property

Actual Number of Risers is different from Desired Number of Risers. Add/remove Risers or change Desired Number of Risers in Stairs Properties.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotEnoughRisers { get; }
```